# Solving real world data science tasks with Python Pandas!
## Keith Galli
- YouTube: https://www.youtube.com/watch?v=eMOA1pPVUc4&list=WL&index=79&t=705s
- Github: https://github.com/KeithGalli/Pandas-Data-Science-Tasks

In [1]:
import pandas as pd
import os

In [2]:
os.getcwd()

'C:\\Users\\Isabelle\\OneDrive - Necando Solutions Inc\\Formation Python\\formations_python_fr\\notebooks'

In [11]:
os.chdir(r'C:\Users\Isabelle\Za\1 Python\1_Jupyter_ex\pandas_ex\Pandas-Data-Science-Tasks-master')
os.getcwd()

'C:\\Users\\Isabelle\\Za\\1 Python\\1_Jupyter_ex\\pandas_ex\\Pandas-Data-Science-Tasks-master'

In [17]:
df = pd.read_csv(r'SalesAnalysis\Sales_Data\Sales_April_2019.csv')

files = [file for file in os.listdir(r'SalesAnalysis\Sales_Data')]
print(files)

['Sales_April_2019.csv', 'Sales_August_2019.csv', 'Sales_December_2019.csv', 'Sales_February_2019.csv', 'Sales_January_2019.csv', 'Sales_July_2019.csv', 'Sales_June_2019.csv', 'Sales_March_2019.csv', 'Sales_May_2019.csv', 'Sales_November_2019.csv', 'Sales_October_2019.csv', 'Sales_September_2019.csv']

In [32]:
all_months_data = pd.DataFrame()

for file in files:
    df = pd.read_csv('SalesAnalysis/Sales_Data/' + file)
    all_months_data = pd.concat([all_months_data, df])

all_months_data.to_csv('all_data.csv', index=False)

In [33]:
all_data = pd.read_csv('all_data.csv')
all_data.sample(5)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
13395,189327,AA Batteries (4-pack),1,3.84,04/11/19 11:33,"246 North St, Los Angeles, CA 90001"
144960,286291,Wired Headphones,1,11.99,11/07/19 18:14,"407 River St, New York City, NY 10001"
186052,258599,Lightning Charging Cable,1,14.95,09/03/19 14:46,"59 Lakeview St, Los Angeles, CA 90001"
6487,182755,Google Phone,1,600,04/29/19 12:14,"371 Spruce St, New York City, NY 10001"
171806,275594,AA Batteries (4-pack),1,3.84,10/15/19 00:57,"89 North St, New York City, NY 10001"

In [34]:
print(all_data.shape)
all_data.info()

(186850, 6)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 186850 entries, 0 to 186849
Data columns (total 6 columns):
Order ID            186305 non-null object
Product             186305 non-null object
Quantity Ordered    186305 non-null object
Price Each          186305 non-null object
Order Date          186305 non-null object
Purchase Address    186305 non-null object
dtypes: object(6)
memory usage: 8.6+ MB

In [39]:
all_data.drop_duplicates(inplace=True)
print(all_data.shape)
all_data.isnull().sum()

(185688, 6)

Order ID            1
Product             1
Quantity Ordered    1
Price Each          1
Order Date          1
Purchase Address    1
dtype: int64

In [42]:
all_data[all_data['Order ID'].isnull()]

  Order ID Product Quantity Ordered Price Each Order Date Purchase Address
1      NaN     NaN              NaN        NaN        NaN              NaN

In [43]:
all_data.dropna(inplace=True)

In [44]:
pd.to_numeric(all_data['Quantity Ordered'])

ValueError: Unable to parse string "Quantity Ordered" at position 516

In [45]:
all_data.iloc[516]

Order ID                    Order ID
Product                      Product
Quantity Ordered    Quantity Ordered
Price Each                Price Each
Order Date                Order Date
Purchase Address    Purchase Address
Name: 519, dtype: object

In [46]:
index_names = all_data[ all_data['Order ID'].str.contains('Order')].index

all_data.drop(index_names, inplace=True)

In [51]:
all_data['Quantity Ordered'] = pd.to_numeric(all_data['Quantity Ordered'])
all_data['Price Each'] = pd.to_numeric(all_data['Price Each'])
all_data['Order Date'] = pd.to_datetime(all_data['Order Date'])
all_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 185686 entries, 0 to 186849
Data columns (total 6 columns):
Order ID            185686 non-null object
Product             185686 non-null object
Quantity Ordered    185686 non-null int64
Price Each          185686 non-null float64
Order Date          185686 non-null datetime64[ns]
Purchase Address    185686 non-null object
dtypes: datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 9.9+ MB

In [52]:
all_data.sample(5)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
138909,280509,Wired Headphones,2,11.99,2019-11-05 18:50:00,"720 Lake St, Dallas, TX 75001"
93612,211789,Lightning Charging Cable,1,14.95,2019-06-05 13:52:00,"985 Forest St, Atlanta, GA 30301"
43137,307827,Apple Airpods Headphones,2,150.00,2019-12-05 13:37:00,"838 1st St, Austin, TX 73301"
2156,178614,AA Batteries (4-pack),2,3.84,2019-04-06 16:17:00,"681 Ridge St, Los Angeles, CA 90001"
30767,296015,Lightning Charging Cable,2,14.95,2019-12-30 04:17:00,"902 1st St, Austin, TX 73301"

### Q1: Best month of sales all Data? How much was earned that month?

In [53]:
all_data['month'] = pd.DatetimeIndex(all_data['Order Date']).month
all_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,month
0,176558,USB-C Charging Cable,2,11.95,2019-04-19 08:46:00,"917 1st St, Dallas, TX 75001",4
2,176559,Bose SoundSport Headphones,1,99.99,2019-04-07 22:30:00,"682 Chestnut St, Boston, MA 02215",4
3,176560,Google Phone,1,600.00,2019-04-12 14:38:00,"669 Spruce St, Los Angeles, CA 90001",4
4,176560,Wired Headphones,1,11.99,2019-04-12 14:38:00,"669 Spruce St, Los Angeles, CA 90001",4
5,176561,Wired Headphones,1,11.99,2019-04-30 09:27:00,"333 8th St, Los Angeles, CA 90001",4

In [54]:
all_data['total'] = all_data['Quantity Ordered'] * all_data['Price Each']

In [63]:
all_data.groupby('month')[['total', 'Quantity Ordered']].sum().astype('int').sort_values('total', ascending=False)

         total  Quantity Ordered
month
12     4608295             28074
10     3734777             22669
4      3389217             20536
11     3197875             19769
5      3150616             18653
3      2804973             16979
7      2646461             16054
6      2576280             15234
8      2241083             13429
2      2200078             13431
9      2094465             13091
1      1821413             10893

In [65]:
all_data.describe().astype(int)

       Quantity Ordered  Price Each   month   total
count            185686      185686  185686  185686
mean                  1         184       7     185
std                   0         332       3     333
min                   1           2       1       2
25%                   1          11       4      11
50%                   1          14       7      14
75%                   1         150      10     150
max                   9        1700      12    3400

In [70]:
all_data[all_data['total'] > 2000]

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,month,total
4717,181069,Macbook Pro Laptop,2,1700.0,2019-04-27 21:01:00,"668 Park St, San Francisco, CA 94016",4,3400.0
5219,181544,Macbook Pro Laptop,2,1700.0,2019-04-22 12:48:00,"731 11th St, New York City, NY 10001",4,3400.0
92026,210292,Macbook Pro Laptop,2,1700.0,2019-06-08 09:00:00,"953 Ridge St, San Francisco, CA 94016",6,3400.0
127265,200528,Macbook Pro Laptop,2,1700.0,2019-05-13 13:40:00,"643 4th St, Boston, MA 02215",5,3400.0

In [ ]:
# 17:19